app/Services/CategoryService.php

select `name`, `id` from `categories`
---
    public function fetchCategory()
    {
        return Category::pluck('name', 'id');