app/Services/FrontService.php

select * from `categories` where `categories`.`id` in (1, 2, 4, 5, 6, 10, 11, 12, 14, 15, 16, 17, 19, 20, 21, 24, 26, 30, 35, 37, 39, 40, 41, 42, 43, 45, 46, 50, 51, 53, 54, 55, 56, 57, 58, 60, 61, 64, 66, 68, 69, 70, 71, 73, 76, 77, 79, 80, 81, 82, 83, 84, 86, 87, 89, 90, 91, 92, 93, 94, 95, 99, 100)
select * from `posts` order by `created_at` desc limit 100 offset 0
select * from `users` where `users`.`id` in (1, 1513, 1514, 1515, 1516, 1517, 1518, 1519, 1520, 1521, 1522, 1523, 1524, 1525, 1526, 1527, 1528, 1529, 1530, 1531, 1532, 1533, 1534, 1535, 1536, 1537, 1538, 1539, 1540, 1541, 1542, 1543, 1544, 1545, 1546, 1547, 1548, 1549, 1550, 1551, 1552, 1553, 1554, 1555, 1556, 1557, 1558, 1769, 1770, 1771, 1772, 1773, 1774, 1775, 1776, 1777, 1778, 1779, 1780, 1781, 1782, 1783, 1784, 1785, 1786, 1787, 1788, 1789, 1790, 1791, 1792, 1793, 1794, 1795, 1796, 1797, 1798, 1799, 1800, 1801, 1802, 1803, 1804, 1805, 1806, 1807, 1808, 1809, 1810, 1811, 1812, 1813, 1814)
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 552, 553, 554, 555, 556, 557, 768, 769, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 780, 781, 782, 783, 784, 785, 786, 787, 788, 789, 790, 791, 792, 793, 794, 795, 796, 797, 798, 799, 800, 801, 802, 803, 804, 805, 806, 807, 808, 809, 810, 811, 812, 813, 1001, 1002, 1004, 1006, 1007, 1008, 1010, 1013)
---
    public function fetchPost()
    {
        return Post::with(['user', 'tags', 'category'])
            ->latest()
            ->paginate(100);

select * from `categories` where `categories`.`id` in (76)
select * from `users` where `users`.`id` in (1107, 1120, 1161, 1200)
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (106, 119, 160, 199)
select distinct * from `posts` where `category_id` is null and `id` != 1013 limit 4
---
    public function relatedPosts($post)
    {

        return Post::with(['user', 'tags', 'category'])->where('category_id', $post->category_id) // Filter by the same category
            ->where('id', '!=', $post->id) // Exclude the current post
            ->distinct()
            ->limit(4)
            ->get();

select * from `categories` where `categories`.`id` in (5)
select * from `posts` where `slug` = 'featured-article-with-the-header-20250315' limit 1
select * from `users` where `users`.`id` in (1)
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (1009)
---
    public function showPost(string $slug): ?Post
    {
        return Post::query()
            ->with(['user', 'tags', 'category'])
            ->where('slug', $slug)
            ->firstOrFail();