app/Services/FrontService.php

select * from `posts` order by `created_at` desc limit 10 offset 0
---
    public function fetchPost(){
        return Post::with(['user', 'tags', 'category'])
                ->latest()
                ->paginate(10);