app/Services/PostService.php

select * from `categories` where `categories`.`id` in (5, 14, 19, 41, 66, 76)
select * from `posts` where `user_id` = '1' order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1)
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (768, 769, 770, 771, 772, 1007, 1008, 1009, 1010, 1011)
---
    public function fetchPost(string $user, string $orderBy = 'asc')
    {
        return Post::query()
            ->with(['user', 'tags', 'category'])
            ->orderBy('created_at', $orderBy)
            ->where('user_id', $user)
            ->paginate(self::PAGINATE_LENGHT)->withPath(route('post.index', ['user' => $user]))
            ->fragment('users');

select exists(select * from `posts` where `slug` = 'non-mollitia-excepte-20250314') as `exists`
insert into `posts` (`user_id`, `title`, `paragraph`, `image`, `slug`, `is_published`, `category_id`) values (1, 'Non mollitia excepte', 'Reprehenderit sint', null, 'non-mollitia-excepte-20250314', 0, '27')
---
    public function insertPost(array $data): ?Post
    {
        // Prevent duplicate slug
        $basedSlug = ! empty($data['slug']) ? $data['slug'] : Str::slug($data['title']);
        $dateSegment = now()->format('Ymd'); // e.g., 20231025
        $slug = "{$basedSlug}-{$dateSegment}"; // Combine base slug and date segment
        $counter = 1;
        $uniqueSlug = $slug;

        // Check for uniqueness
        while (Post::where('slug', $uniqueSlug)->exists()) {
            $uniqueSlug = "{$basedSlug}-{$dateSegment}-{$counter}"; // Append counter if needed
            $counter++;
        }
        // Create the post with the unique slug
        try {
            return Post::create([
                'user_id' => Auth::user()->id,
                'title' => $data['title'] ?? null,
                'paragraph' => $data['paragraph'] ?? null,
                'image' => $data['image'] ?? null,
                'slug' => $uniqueSlug,
                'is_published' => $data['is_published'] ?? false,
                'category_id' => $data['category_id'] ?? null,
            ]);

insert into `tags` (`name`) values ('Ea duis vel aut pari')
select * from `tags` where (`name` = 'tailwind') limit 1
---
    public function handleTags($tags)
    {
        $tagsId = [];
        foreach (explode(',', $tags) as $tag) {
            $tag = trim($tag);
            if (! empty($tag)) {
                $tagModel = Tag::firstOrCreate(['name' => $tag]);

select * from `posts` where `slug` = 'featured-article-with-the-header-20250315' limit 1
select * from `users` where `users`.`id` in (1)
select `tags`.*, `post_tag`.`post_id` as `pivot_post_id`, `post_tag`.`tag_id` as `pivot_tag_id` from `tags` inner join `post_tag` on `tags`.`id` = `post_tag`.`tag_id` where `post_tag`.`post_id` in (1011)
---
    public function showPost(string $slug): ?Post
    {
        return Post::query()
            ->with(['user', 'tags'])
            ->where('slug', $slug)
            ->firstOrFail();

select * from `posts` where `slug` = 'featured-article-with-the-header-20250315' limit 1
---
    public function updatePost(string $slug, array $data): ?Post
    {
        $post = Post::where('slug', $slug)->firstOrFail();