app/Services/PostService.php

insert into `posts` (`user_id`, `title`, `paragraph`, `image`, `slug`, `is_published`) values (1, 'Reading PHP Source Code Through A Browser', 'Last night Saturday 20th July 2019, as I sat through a boring day, I decided to make the night worthwhile. Feeling like a super hero all of a sudden I decided to do the almost impossible, hence our title “reading PHP source code through a browser.”\r\n\r\nI came across an end point which had a file upload functionality.\r\nI then decided to fill the forms and upload an image to understand how this server worked. After a 200 status, I decide to see if the site had a restriction on the type of files the server was accepting. I uploaded a php file and surprisingly i got this:\r\nI later realized uploading the malicious PHP file unto the server didn’t look realistic. Why?\r\n\r\nAll uploads were images, and it was weird to have an upload which had no image to show.\r\nRight clicking on the file and “opening image in new tab” didn’t show any image. That would look suspicious if the admin should see something like this on his server\r\nSo i thought why not make my malicious code call image from the targets server. I then modified my script and added this:', 'postImages/Pi9dbQQxoYiE8sm4kz5cWiUMjgUHAqBxCiIaky0U.jpg', 'reading-php-source-code-through-a-browser-20250312', 1)
---
    public function insertPost(array $data): ?Post
    {
        // Prevent duplicate slug
        $basedSlug = ! empty($data['slug']) ? $data['slug'] : Str::slug($data['title']);
        $dateSegment = now()->format('Ymd'); // e.g., 20231025
        $slug = "{$basedSlug}-{$dateSegment}"; // Combine base slug and date segment
        $counter = 1;
        $uniqueSlug = $slug;

        // Check for uniqueness
        while (Post::where('slug', $uniqueSlug)->exists()) {
            $uniqueSlug = "{$basedSlug}-{$dateSegment}-{$counter}"; // Append counter if needed
            $counter++;
        }
        // Create the post with the unique slug
        try {
            return Post::create([
                'user_id' => Auth::user()->id,
                'title' => $data['title'] ?? null,
                'paragraph' => $data['paragraph'] ?? null,
                'image' => $data['image'] ?? null,
                'slug' => $uniqueSlug, // Use the unique slug here
                'is_published' => $data['is_published'] ?? false,
            ]);

select * from `posts` where `slug` = 'lets-20250309' limit 1
select * from `users` where `users`.`id` in (1)
---
    public function showPost(string $slug): ?Post
    {
        return Post::query()
            ->with('user')
            ->where('slug', $slug)
            ->firstOrFail();

delete from `posts` where `id` = 1044
---
    public function updatePost(string $slug, array $data): ?Post
    {
        $post = Post::where('slug', $slug)->firstOrFail();
        // hand the replacement of the image
        if (array_key_exists('image', $data)) {
            if ($post->image && $data['image'] !== $post->image && $data['image'] !== null) {
                Storage::disk('public')->delete($post->image);

update `posts` set `paragraph` = 'Lets try thiss', `is_published` = 0 where `id` = 1054
---
            $post->slug = $uniqueSlug;
        }

        $post->save();