app/Services/PostService.php

select * from `posts` where `user_id` = '1' limit 10 offset 0
---
    public function fetch(string $user)
    {
        return Post::query()
            ->with('user')
            ->where('user_id', $user)
            ->paginate(10);