app/Livewire/UserProfile/Index.php

    public function render()
    {

        $userId = Auth::id();
        $cacheKey = self::CACHE_KEY . $userId;
        $student = Cache::remember($cacheKey, self::CACHE_TIME, function () use ($userId) {
            return Student::with(['user'])->where('user_id', $userId)->first();
        });
---
select * from "students" where "user_id" = 1 limit 1