app/Http/Controllers/Post/PostController.php

    public function store(Request $request, PostService $postService, UploadImages $uploadImages)
    {
        $validate = $request->validate([
            'title' => 'required|max:100',
            'paragraph' => 'required|string',
            'image' => 'nullable|image|mimes:jpeg,png,jpg,gif,svg|max:2048', // Max 2MB
            'is_published' => 'sometimes|boolean',
            'tags' => 'nullable|string',
            'category_id' => 'nullable|exists:categories,id',
        ]);
        // Handle image upload
        $validate['image'] = $uploadImages->uploadImage($request->file('image'));
        $validate['is_published'] = $request->has('is_published');
        $validate['slug'] = $request->input('slug', Str::slug($request->title));
        $validate['category_id'] = $request->input('category_id', null);
        $post = $postService->insertPost($validate);

        if ($request->has('tags')) {
            $post->tags()->attach($postService->handleTags($request->tags));
---
insert into `post_tag` (`post_id`, `tag_id`) values (1002, 4)

    public function update(Request $request, string $slug, PostService $postService, UploadImages $uploadImages)
    {
        $post = $postService->showPost($slug);
        $this->authorize('update', $post);
        $validate = $request->validate([
            'title' => 'required|max:100',
            'paragraph' => 'required|string',
            'image' => 'nullable|image|mimes:jpeg,png,jpg,gif,svg|max:2048',
            'tags' => 'nullable|string',
            'is_published' => 'sometimes|boolean',
            'category_id' => 'nullable|exists:categories,id',
        ]);

        if ($request->hasFile('image')) {
            $validate['image'] = $uploadImages->uploadImage($request->file('image'));
        }
        try {
            $validate['is_published'] = $request->has('is_published');
            $validate['category_id'] = $request->input('category_id', null);

            if ($request->has('tags')) {
                $post->tags()->sync($postService->handleTags($request->tags));
---
insert into `post_tag` (`post_id`, `tag_id`) values (1007, 204)